In [1]:
import pandas as pd
df = pd.DataFrame({'key':['A','B','C','A','B','C'],
                 'value':[0,5,10,25,10,8]})

In [2]:
df

  key  value
0   A      0
1   B      5
2   C     10
3   A     25
4   B     10
5   C      8

In [3]:
import numpy as np
df.groupby('key').aggregate(np.mean)

     value
key
A     12.5
B      7.5
C      9.0

In [4]:
df.min()

key      A
value    0
dtype: object

In [6]:
s = np.random.randn(6,4)
s

array([[-1.11948749, -1.55683872,  1.97155392, -0.66098262],
       [-0.57953239, -0.17525027, -1.08630631, -0.41671317],
       [-0.3047942 ,  0.37729518,  1.11062102,  2.2808017 ],
       [-0.54439899,  0.77003386,  1.432927  ,  0.252739  ],
       [-0.45418844,  0.35438291,  0.91405609,  1.58084501],
       [-1.12275922,  0.98062169, -0.24988215, -1.80701275]])

In [7]:
df = pd.DataFrame(s, columns=list('ABCD'))
df

          A         B         C         D
0 -1.119487 -1.556839  1.971554 -0.660983
1 -0.579532 -0.175250 -1.086306 -0.416713
2 -0.304794  0.377295  1.110621  2.280802
3 -0.544399  0.770034  1.432927  0.252739
4 -0.454188  0.354383  0.914056  1.580845
5 -1.122759  0.980622 -0.249882 -1.807013

In [9]:
df.iloc[0]

A   -1.119487
B   -1.556839
C    1.971554
D   -0.660983
Name: 0, dtype: float64

In [10]:
df.A

0   -1.119487
1   -0.579532
2   -0.304794
3   -0.544399
4   -0.454188
5   -1.122759
Name: A, dtype: float64

In [11]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [12]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [14]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.687527  0.125041  0.682162  0.204946
std    0.349026  0.914676  1.136637  1.509227
min   -1.122759 -1.556839 -1.086306 -1.807013
25%   -0.984499 -0.042842  0.041102 -0.599915
50%   -0.561966  0.365839  1.012339 -0.081987
75%   -0.476741  0.671849  1.352351  1.248819
max   -0.304794  0.980622  1.971554  2.280802

In [15]:
df

          A         B         C         D
0 -1.119487 -1.556839  1.971554 -0.660983
1 -0.579532 -0.175250 -1.086306 -0.416713
2 -0.304794  0.377295  1.110621  2.280802
3 -0.544399  0.770034  1.432927  0.252739
4 -0.454188  0.354383  0.914056  1.580845
5 -1.122759  0.980622 -0.249882 -1.807013

In [20]:
df.sort_index(axis=0,ascending=False)

          A         B         C         D
5 -1.122759  0.980622 -0.249882 -1.807013
4 -0.454188  0.354383  0.914056  1.580845
3 -0.544399  0.770034  1.432927  0.252739
2 -0.304794  0.377295  1.110621  2.280802
1 -0.579532 -0.175250 -1.086306 -0.416713
0 -1.119487 -1.556839  1.971554 -0.660983

In [22]:
df.sort_values(by='C', ascending=False)

          A         B         C         D
0 -1.119487 -1.556839  1.971554 -0.660983
3 -0.544399  0.770034  1.432927  0.252739
2 -0.304794  0.377295  1.110621  2.280802
4 -0.454188  0.354383  0.914056  1.580845
5 -1.122759  0.980622 -0.249882 -1.807013
1 -0.579532 -0.175250 -1.086306 -0.416713

In [23]:
df[['A', 'C']]

          A         C
0 -1.119487  1.971554
1 -0.579532 -1.086306
2 -0.304794  1.110621
3 -0.544399  1.432927
4 -0.454188  0.914056
5 -1.122759 -0.249882

In [28]:
df.iloc[3,2]

1.4329269998240968

In [26]:
df

          A         B         C         D
0 -1.119487 -1.556839  1.971554 -0.660983
1 -0.579532 -0.175250 -1.086306 -0.416713
2 -0.304794  0.377295  1.110621  2.280802
3 -0.544399  0.770034  1.432927  0.252739
4 -0.454188  0.354383  0.914056  1.580845
5 -1.122759  0.980622 -0.249882 -1.807013

In [29]:
df[df.B > 0]

          A         B         C         D
2 -0.304794  0.377295  1.110621  2.280802
3 -0.544399  0.770034  1.432927  0.252739
4 -0.454188  0.354383  0.914056  1.580845
5 -1.122759  0.980622 -0.249882 -1.807013

In [36]:
df[5:]

          A         B         C         D
5 -1.122759  0.980622 -0.249882 -1.807013

In [40]:
df[['B','D']]

          B         D
0 -1.556839 -0.660983
1 -0.175250 -0.416713
2  0.377295  2.280802
3  0.770034  0.252739
4  0.354383  1.580845
5  0.980622 -1.807013

In [41]:
df['TAG'] = ['cat', 'dog', 'cat', 'dog', 'cat', 'dog']

In [42]:
df

          A         B         C         D  TAG
0 -1.119487 -1.556839  1.971554 -0.660983  cat
1 -0.579532 -0.175250 -1.086306 -0.416713  dog
2 -0.304794  0.377295  1.110621  2.280802  cat
3 -0.544399  0.770034  1.432927  0.252739  dog
4 -0.454188  0.354383  0.914056  1.580845  cat
5 -1.122759  0.980622 -0.249882 -1.807013  dog

In [46]:
df.groupby('TAG').sum()

            A         B         C         D
TAG
cat -1.878470 -0.825161  3.996231  3.200664
dog -2.246691  1.575405  0.096739 -1.970987